[Killed] BlockStatement
src/domain/balances.ts:17:35
     balances[member.id] = 0;
   }
 
-  for (const expense of expenses) {
-    // Le payeur est crédité du montant total
-    if (expense.paidBy in balances) {
-      balances[expense.paidBy] += expense.amount;
-    }
-
-    const { split } = expense;
-
-    if (split.mode === 'equal') {
-      const share = expense.amount / split.beneficiaries.length;
-      for (const id of split.beneficiaries) {
-        if (id in balances) balances[id] -= share;
-      }
-    } else if (split.mode === 'weighted') {
-      const totalWeight = Object.values(split.weights).reduce((s, w) => s + w, 0);
-      for (const [id, weight] of Object.entries(split.weights)) {
-        if (id in balances) balances[id] -= (weight / totalWeight) * expense.amount;
-      }
-    } else {
-      // percentage
-      for (const [id, pct] of Object.entries(split.percentages)) {
-        if (id in balances) balances[id] -= (pct / 100) * expense.amount;
-      }
-    }
-  }
+  for (const expense of expenses) {}
 
   return balances;
killedBy: computeBalances repartit une depense equal entre 3 personnes (payeur inclus comme beneficiaire)
statusReason: expected +0 to be close to 20, received difference is 20, but expected 0.005

[Killed] ConditionalExpression
src/domain/balances.ts:19:9
 
   for (const expense of expenses) {
     // Le payeur est crédité du montant total
-    if (expense.paidBy in balances) {
+    if (false) {
       balances[expense.paidBy] += expense.amount;
     }
killedBy: computeBalances repartit une depense equal entre 3 personnes (payeur inclus comme beneficiaire)
statusReason: expected -10 to be close to 20, received difference is 30, but expected 0.005

[Killed] BlockStatement
src/domain/balances.ts:19:37
 
   for (const expense of expenses) {
     // Le payeur est crédité du montant total
-    if (expense.paidBy in balances) {
-      balances[expense.paidBy] += expense.amount;
-    }
+    if (expense.paidBy in balances) {}
 
     const { split } = expense;
killedBy: computeBalances repartit une depense equal entre 3 personnes (payeur inclus comme beneficiaire)
statusReason: expected -10 to be close to 20, received difference is 30, but expected 0.005

[Killed] AssignmentOperator
src/domain/balances.ts:20:7
   for (const expense of expenses) {
     // Le payeur est crédité du montant total
     if (expense.paidBy in balances) {
-      balances[expense.paidBy] += expense.amount;
+      balances[expense.paidBy] -= expense.amount;
     }
 
killedBy: computeBalances repartit une depense equal entre 3 personnes (payeur inclus comme beneficiaire)
statusReason: expected -40 to be close to 20, received difference is 60, but expected 0.005

[Killed] ConditionalExpression
src/domain/balances.ts:25:9
 
     const { split } = expense;
 
-    if (split.mode === 'equal') {
+    if (false) {
       const share = expense.amount / split.beneficiaries.length;
       for (const id of split.beneficiaries) {
killedBy: computeBalances repartit une depense equal entre 3 personnes (payeur inclus comme beneficiaire)
statusReason: Cannot convert undefined or null to object

[Killed] EqualityOperator
src/domain/balances.ts:25:9
 
     const { split } = expense;
 
-    if (split.mode === 'equal') {
+    if (split.mode !== 'equal') {
       const share = expense.amount / split.beneficiaries.length;
       for (const id of split.beneficiaries) {
killedBy: computeBalances repartit une depense equal entre 3 personnes (payeur inclus comme beneficiaire)
statusReason: Cannot convert undefined or null to object

[Killed] ArithmeticOperator
src/domain/balances.ts:26:21
     const { split } = expense;
 
     if (split.mode === 'equal') {
-      const share = expense.amount / split.beneficiaries.length;
+      const share = expense.amount * split.beneficiaries.length;
       for (const id of split.beneficiaries) {
         if (id in balances) balances[id] -= share;
killedBy: computeBalances repartit une depense equal entre 3 personnes (payeur inclus comme beneficiaire)
statusReason: expected -60 to be close to 20, received difference is 80, but expected 0.005

[Killed] BlockStatement
src/domain/balances.ts:27:45
 
     if (split.mode === 'equal') {
       const share = expense.amount / split.beneficiaries.length;
-      for (const id of split.beneficiaries) {
-        if (id in balances) balances[id] -= share;
-      }
+      for (const id of split.beneficiaries) {}
     } else if (split.mode === 'weighted') {
       const totalWeight = Object.values(split.weights).reduce((s, w) => s + w, 0);
killedBy: computeBalances repartit une depense equal entre 3 personnes (payeur inclus comme beneficiaire)
statusReason: expected 30 to be close to 20, received difference is 10, but expected 0.005

[Killed] AssignmentOperator
src/domain/balances.ts:28:29
     if (split.mode === 'equal') {
       const share = expense.amount / split.beneficiaries.length;
       for (const id of split.beneficiaries) {
-        if (id in balances) balances[id] -= share;
+        if (id in balances) balances[id] += share;
       }
     } else if (split.mode === 'weighted') {
killedBy: computeBalances repartit une depense equal entre 3 personnes (payeur inclus comme beneficiaire)
statusReason: expected 40 to be close to 20, received difference is 20, but expected 0.005

[Killed] ConditionalExpression
src/domain/balances.ts:28:13
     if (split.mode === 'equal') {
       const share = expense.amount / split.beneficiaries.length;
       for (const id of split.beneficiaries) {
-        if (id in balances) balances[id] -= share;
+        if (false) balances[id] -= share;
       }
     } else if (split.mode === 'weighted') {
killedBy: computeBalances repartit une depense equal entre 3 personnes (payeur inclus comme beneficiaire)
statusReason: expected 30 to be close to 20, received difference is 10, but expected 0.005

[Killed] BlockStatement
src/domain/balances.ts:30:43
       for (const id of split.beneficiaries) {
         if (id in balances) balances[id] -= share;
       }
-    } else if (split.mode === 'weighted') {
-      const totalWeight = Object.values(split.weights).reduce((s, w) => s + w, 0);
-      for (const [id, weight] of Object.entries(split.weights)) {
-        if (id in balances) balances[id] -= (weight / totalWeight) * expense.amount;
-      }
-    } else {
+    } else if (split.mode === 'weighted') {} else {
       // percentage
       for (const [id, pct] of Object.entries(split.percentages)) {
killedBy: computeBalances repartit une depense weighted avec poids non-uniformes
statusReason: expected 30 to be close to 15, received difference is 15, but expected 0.005

[Killed] EqualityOperator
src/domain/balances.ts:30:16
       for (const id of split.beneficiaries) {
         if (id in balances) balances[id] -= share;
       }
-    } else if (split.mode === 'weighted') {
+    } else if (split.mode !== 'weighted') {
       const totalWeight = Object.values(split.weights).reduce((s, w) => s + w, 0);
       for (const [id, weight] of Object.entries(split.weights)) {
killedBy: computeBalances repartit une depense weighted avec poids non-uniformes
statusReason: Cannot convert undefined or null to object

[Killed] ArrowFunction
src/domain/balances.ts:31:63
         if (id in balances) balances[id] -= share;
       }
     } else if (split.mode === 'weighted') {
-      const totalWeight = Object.values(split.weights).reduce((s, w) => s + w, 0);
+      const totalWeight = Object.values(split.weights).reduce(() => undefined, 0);
       for (const [id, weight] of Object.entries(split.weights)) {
         if (id in balances) balances[id] -= (weight / totalWeight) * expense.amount;
killedBy: computeBalances repartit une depense weighted avec poids non-uniformes
statusReason: expected NaN to be close to 15, received difference is NaN, but expected 0.005

[Killed] ArithmeticOperator
src/domain/balances.ts:31:73
         if (id in balances) balances[id] -= share;
       }
     } else if (split.mode === 'weighted') {
-      const totalWeight = Object.values(split.weights).reduce((s, w) => s + w, 0);
+      const totalWeight = Object.values(split.weights).reduce((s, w) => s - w, 0);
       for (const [id, weight] of Object.entries(split.weights)) {
         if (id in balances) balances[id] -= (weight / totalWeight) * expense.amount;
killedBy: computeBalances repartit une depense weighted avec poids non-uniformes
statusReason: expected 45 to be close to 15, received difference is 30, but expected 0.005

[Killed] BlockStatement
src/domain/balances.ts:32:65
       }
     } else if (split.mode === 'weighted') {
       const totalWeight = Object.values(split.weights).reduce((s, w) => s + w, 0);
-      for (const [id, weight] of Object.entries(split.weights)) {
-        if (id in balances) balances[id] -= (weight / totalWeight) * expense.amount;
-      }
+      for (const [id, weight] of Object.entries(split.weights)) {}
     } else {
       // percentage
killedBy: computeBalances repartit une depense weighted avec poids non-uniformes
statusReason: expected 30 to be close to 15, received difference is 15, but expected 0.005

[Killed] ConditionalExpression
src/domain/balances.ts:33:13
     } else if (split.mode === 'weighted') {
       const totalWeight = Object.values(split.weights).reduce((s, w) => s + w, 0);
       for (const [id, weight] of Object.entries(split.weights)) {
-        if (id in balances) balances[id] -= (weight / totalWeight) * expense.amount;
+        if (false) balances[id] -= (weight / totalWeight) * expense.amount;
       }
     } else {
killedBy: computeBalances repartit une depense weighted avec poids non-uniformes
statusReason: expected 30 to be close to 15, received difference is 15, but expected 0.005

[Killed] AssignmentOperator
src/domain/balances.ts:33:29
     } else if (split.mode === 'weighted') {
       const totalWeight = Object.values(split.weights).reduce((s, w) => s + w, 0);
       for (const [id, weight] of Object.entries(split.weights)) {
-        if (id in balances) balances[id] -= (weight / totalWeight) * expense.amount;
+        if (id in balances) balances[id] += weight / totalWeight * expense.amount;
       }
     } else {
killedBy: computeBalances repartit une depense weighted avec poids non-uniformes
statusReason: expected 45 to be close to 15, received difference is 30, but expected 0.005

[Killed] BlockStatement
src/domain/balances.ts:35:12
       for (const [id, weight] of Object.entries(split.weights)) {
         if (id in balances) balances[id] -= (weight / totalWeight) * expense.amount;
       }
-    } else {
-      // percentage
-      for (const [id, pct] of Object.entries(split.percentages)) {
-        if (id in balances) balances[id] -= (pct / 100) * expense.amount;
-      }
-    }
+    } else {}
   }
 
killedBy: computeBalances repartit une depense percentage avec arrondis (33.33+33.33+33.34=100)
statusReason: expected 100 to be close to +0, received difference is 100, but expected 0.000005

[Killed] BlockStatement
src/domain/balances.ts:37:66
       }
     } else {
       // percentage
-      for (const [id, pct] of Object.entries(split.percentages)) {
-        if (id in balances) balances[id] -= (pct / 100) * expense.amount;
-      }
+      for (const [id, pct] of Object.entries(split.percentages)) {}
     }
   }
killedBy: computeBalances repartit une depense percentage avec arrondis (33.33+33.33+33.34=100)
statusReason: expected 100 to be close to +0, received difference is 100, but expected 0.000005

[Killed] ArithmeticOperator
src/domain/balances.ts:38:45
     } else {
       // percentage
       for (const [id, pct] of Object.entries(split.percentages)) {
-        if (id in balances) balances[id] -= (pct / 100) * expense.amount;
+        if (id in balances) balances[id] -= pct / 100 / expense.amount;
       }
     }
killedBy: computeBalances repartit une depense percentage avec arrondis (33.33+33.33+33.34=100)
statusReason: expected 99.99000000000001 to be close to +0, received difference is 99.99000000000001, but expected 0.000005

[Killed] AssignmentOperator
src/domain/balances.ts:38:29
     } else {
       // percentage
       for (const [id, pct] of Object.entries(split.percentages)) {
-        if (id in balances) balances[id] -= (pct / 100) * expense.amount;
+        if (id in balances) balances[id] += pct / 100 * expense.amount;
       }
     }
killedBy: computeBalances repartit une depense percentage avec arrondis (33.33+33.33+33.34=100)
statusReason: expected 199.99999999999997 to be close to +0, received difference is 199.99999999999997, but expected 0.000005
