[Survived] MethodExpression
src/domain/simplify.ts:13:21
 export function simplifyDebts(balances: Balances): Settlement[] {
   const settlements: Settlement[] = [];
 
-  const creditors = Object.entries(balances)
-    .filter(([, b]) => b > 0.001)
+  const creditors = Object.entries(balances)
     .map(([id, amount]) => ({ id, amount }));
 

[Killed] EqualityOperator
src/domain/simplify.ts:14:24
   const settlements: Settlement[] = [];
 
   const creditors = Object.entries(balances)
-    .filter(([, b]) => b > 0.001)
+    .filter(([, b]) => b <= 0.001)
     .map(([id, amount]) => ({ id, amount }));
 
killedBy: simplifyDebts regle une dette entre 2 personnes en 1 settlement
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/domain/simplify.ts:14:24
   const settlements: Settlement[] = [];
 
   const creditors = Object.entries(balances)
-    .filter(([, b]) => b > 0.001)
+    .filter(([, b]) => false)
     .map(([id, amount]) => ({ id, amount }));
 
killedBy: simplifyDebts regle une dette entre 2 personnes en 1 settlement
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/domain/simplify.ts:15:10
 
   const creditors = Object.entries(balances)
     .filter(([, b]) => b > 0.001)
-    .map(([id, amount]) => ({ id, amount }));
+    .map(() => undefined);
 
   const debtors = Object.entries(balances)
killedBy: simplifyDebts regle une dette entre 2 personnes en 1 settlement
statusReason: Cannot read properties of undefined (reading 'amount')

[Timeout] ObjectLiteral
src/domain/simplify.ts:15:29
 
   const creditors = Object.entries(balances)
     .filter(([, b]) => b > 0.001)
-    .map(([id, amount]) => ({ id, amount }));
+    .map(([id, amount]) => ({}));
 
   const debtors = Object.entries(balances)

[Survived] MethodExpression
src/domain/simplify.ts:17:19
     .filter(([, b]) => b > 0.001)
     .map(([id, amount]) => ({ id, amount }));
 
-  const debtors = Object.entries(balances)
-    .filter(([, b]) => b < -0.001)
+  const debtors = Object.entries(balances)
     .map(([id, amount]) => ({ id, amount: -amount }));
 

[Killed] EqualityOperator
src/domain/simplify.ts:18:24
     .map(([id, amount]) => ({ id, amount }));
 
   const debtors = Object.entries(balances)
-    .filter(([, b]) => b < -0.001)
+    .filter(([, b]) => b >= -0.001)
     .map(([id, amount]) => ({ id, amount: -amount }));
 
killedBy: simplifyDebts regle une dette entre 2 personnes en 1 settlement
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/domain/simplify.ts:18:13
     .map(([id, amount]) => ({ id, amount }));
 
   const debtors = Object.entries(balances)
-    .filter(([, b]) => b < -0.001)
+    .filter(() => undefined)
     .map(([id, amount]) => ({ id, amount: -amount }));
 
killedBy: simplifyDebts regle une dette entre 2 personnes en 1 settlement
statusReason: expected [] to have a length of 1 but got +0

[Killed] UnaryOperator
src/domain/simplify.ts:19:43
 
   const debtors = Object.entries(balances)
     .filter(([, b]) => b < -0.001)
-    .map(([id, amount]) => ({ id, amount: -amount }));
+    .map(([id, amount]) => ({ id, amount: +amount }));
 
   creditors.sort((a, b) => b.amount - a.amount);
killedBy: simplifyDebts regle une dette entre 2 personnes en 1 settlement
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/domain/simplify.ts:19:10
 
   const debtors = Object.entries(balances)
     .filter(([, b]) => b < -0.001)
-    .map(([id, amount]) => ({ id, amount: -amount }));
+    .map(() => undefined);
 
   creditors.sort((a, b) => b.amount - a.amount);
killedBy: simplifyDebts regle une dette entre 2 personnes en 1 settlement
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] ArithmeticOperator
src/domain/simplify.ts:21:28
     .filter(([, b]) => b < -0.001)
     .map(([id, amount]) => ({ id, amount: -amount }));
 
-  creditors.sort((a, b) => b.amount - a.amount);
+  creditors.sort((a, b) => b.amount + a.amount);
   debtors.sort((a, b) => b.amount - a.amount);
 
killedBy: simplifyDebts settlement partiel : le plus grand crediteur est rembourse en premier meme si declare apres
statusReason: expected { from: 'c', to: 'b', amount: 20 } to deeply equal { from: 'c', to: 'a', amount: 30 }

[Killed] ArrowFunction
src/domain/simplify.ts:21:18
     .filter(([, b]) => b < -0.001)
     .map(([id, amount]) => ({ id, amount: -amount }));
 
-  creditors.sort((a, b) => b.amount - a.amount);
+  creditors.sort(() => undefined);
   debtors.sort((a, b) => b.amount - a.amount);
 
killedBy: simplifyDebts settlement partiel : le plus grand crediteur est rembourse en premier meme si declare apres
statusReason: expected { from: 'c', to: 'b', amount: 20 } to deeply equal { from: 'c', to: 'a', amount: 30 }

[Killed] MethodExpression
src/domain/simplify.ts:22:3
     .map(([id, amount]) => ({ id, amount: -amount }));
 
   creditors.sort((a, b) => b.amount - a.amount);
-  debtors.sort((a, b) => b.amount - a.amount);
+  debtors;
 
   let ci = 0;
killedBy: simplifyDebts produit exactement 2 settlements grace au tri decroissant (paires 1-pour-1)
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] ArithmeticOperator
src/domain/simplify.ts:22:26
     .map(([id, amount]) => ({ id, amount: -amount }));
 
   creditors.sort((a, b) => b.amount - a.amount);
-  debtors.sort((a, b) => b.amount - a.amount);
+  debtors.sort((a, b) => b.amount + a.amount);
 
   let ci = 0;
killedBy: simplifyDebts produit exactement 2 settlements grace au tri decroissant (paires 1-pour-1)
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] LogicalOperator
src/domain/simplify.ts:27:10
   let ci = 0;
   let di = 0;
 
-  while (ci < creditors.length && di < debtors.length) {
+  while (ci < creditors.length || di < debtors.length) {
     const creditor = creditors[ci];
     const debtor = debtors[di];
killedBy: simplifyDebts arrete la boucle quand les debiteurs sont epuises (credit > dette)
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] ConditionalExpression
src/domain/simplify.ts:27:35
   let ci = 0;
   let di = 0;
 
-  while (ci < creditors.length && di < debtors.length) {
+  while (ci < creditors.length && true) {
     const creditor = creditors[ci];
     const debtor = debtors[di];
killedBy: simplifyDebts arrete la boucle quand les debiteurs sont epuises (credit > dette)
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] MethodExpression
src/domain/simplify.ts:31:20
     const creditor = creditors[ci];
     const debtor = debtors[di];
 
-    const amount = Math.min(creditor.amount, debtor.amount);
+    const amount = Math.max(creditor.amount, debtor.amount);
     const rounded = Math.round(amount * 100) / 100;
 
killedBy: simplifyDebts 4 personnes : 2 settlements minimum, pas 3
statusReason: expected [ { from: 'b', to: 'a', amount: 30 } ] to have a length of 2 but got 1

[Killed] ArithmeticOperator
src/domain/simplify.ts:32:32
     const debtor = debtors[di];
 
     const amount = Math.min(creditor.amount, debtor.amount);
-    const rounded = Math.round(amount * 100) / 100;
+    const rounded = Math.round(amount / 100) / 100;
 
     if (rounded > 0) {
killedBy: simplifyDebts regle une dette entre 2 personnes en 1 settlement
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/domain/simplify.ts:32:21
     const debtor = debtors[di];
 
     const amount = Math.min(creditor.amount, debtor.amount);
-    const rounded = Math.round(amount * 100) / 100;
+    const rounded = Math.round(amount * 100) * 100;
 
     if (rounded > 0) {
killedBy: simplifyDebts regle une dette entre 2 personnes en 1 settlement
statusReason: expected { from: 'b', to: 'a', amount: 100000 } to deeply equal { from: 'b', to: 'a', amount: 10 }

[Killed] EqualityOperator
src/domain/simplify.ts:34:9
     const amount = Math.min(creditor.amount, debtor.amount);
     const rounded = Math.round(amount * 100) / 100;
 
-    if (rounded > 0) {
+    if (rounded >= 0) {
       settlements.push({ from: debtor.id, to: creditor.id, amount: rounded });
     }
killedBy: simplifyDebts ne cree pas de settlement si le montant arrondi vaut 0
statusReason: expected [ { from: 'b', to: 'a', amount: +0 } ] to deeply equal []

[Killed] ConditionalExpression
src/domain/simplify.ts:34:9
     const amount = Math.min(creditor.amount, debtor.amount);
     const rounded = Math.round(amount * 100) / 100;
 
-    if (rounded > 0) {
+    if (true) {
       settlements.push({ from: debtor.id, to: creditor.id, amount: rounded });
     }
killedBy: simplifyDebts ne cree pas de settlement si le montant arrondi vaut 0
statusReason: expected [ { from: 'b', to: 'a', amount: +0 } ] to deeply equal []

[Killed] ObjectLiteral
src/domain/simplify.ts:35:24
     const rounded = Math.round(amount * 100) / 100;
 
     if (rounded > 0) {
-      settlements.push({ from: debtor.id, to: creditor.id, amount: rounded });
+      settlements.push({});
     }
 
killedBy: simplifyDebts regle une dette entre 2 personnes en 1 settlement
statusReason: expected {} to deeply equal { from: 'b', to: 'a', amount: 10 }

[Killed] AssignmentOperator
src/domain/simplify.ts:38:5
       settlements.push({ from: debtor.id, to: creditor.id, amount: rounded });
     }
 
-    creditor.amount -= amount;
+    creditor.amount += amount;
     debtor.amount -= amount;
 
killedBy: simplifyDebts produit exactement 2 settlements grace au tri decroissant (paires 1-pour-1)
statusReason: expected [ …(2) ] to deep equally contain { from: 'c', to: 'b', amount: 40 }

[Killed] AssignmentOperator
src/domain/simplify.ts:39:5
     }
 
     creditor.amount -= amount;
-    debtor.amount -= amount;
+    debtor.amount += amount;
 
     if (creditor.amount < 0.001) ci++;
killedBy: simplifyDebts 4 personnes : 2 settlements minimum, pas 3
statusReason: expected [ …(2) ] to deep equally contain { from: 'c', to: 'a', amount: 10 }

[Killed] EqualityOperator
src/domain/simplify.ts:41:9
     creditor.amount -= amount;
     debtor.amount -= amount;
 
-    if (creditor.amount < 0.001) ci++;
+    if (creditor.amount >= 0.001) ci++;
     if (debtor.amount < 0.001) di++;
   }
killedBy: simplifyDebts 4 personnes : 2 settlements minimum, pas 3
statusReason: expected [ { from: 'b', to: 'a', amount: 20 } ] to have a length of 2 but got 1

[Killed] UpdateOperator
src/domain/simplify.ts:41:34
     creditor.amount -= amount;
     debtor.amount -= amount;
 
-    if (creditor.amount < 0.001) ci++;
+    if (creditor.amount < 0.001) ci--;
     if (debtor.amount < 0.001) di++;
   }
killedBy: simplifyDebts plusieurs crediteurs et plusieurs debiteurs - nombre minimal de settlements
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] ConditionalExpression
src/domain/simplify.ts:42:9
     debtor.amount -= amount;
 
     if (creditor.amount < 0.001) ci++;
-    if (debtor.amount < 0.001) di++;
+    if (true) di++;
   }
 
killedBy: simplifyDebts plusieurs crediteurs et plusieurs debiteurs - nombre minimal de settlements
statusReason: expected 10 to be close to 30, received difference is 20, but expected 0.005

[Killed] UpdateOperator
src/domain/simplify.ts:42:32
     debtor.amount -= amount;
 
     if (creditor.amount < 0.001) ci++;
-    if (debtor.amount < 0.001) di++;
+    if (debtor.amount < 0.001) di--;
   }
 
killedBy: simplifyDebts 4 personnes : 2 settlements minimum, pas 3
statusReason: Cannot read properties of undefined (reading 'amount')
